# python with sql
we need to connect between python and sql , without connector we will not establish a communication between these two .

In [1]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\annam\appdata\local\anaconda3\lib\site-packages (8.0.33)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\annam\appdata\local\anaconda3\lib\site-packages (from mysql-connector-python) (3.20.3)
Note: you may need to restart the kernel to use updated packages.

In [15]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\annam\appdata\local\anaconda3\lib\site-packages (8.0.33)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\annam\appdata\local\anaconda3\lib\site-packages (from mysql-connector-python) (3.20.3)

In [16]:
import mysql.connector as connection

In [17]:
conn = connection.connect(host = "localhost", user = "root", passwd = '1998', use_pure = True)

In [18]:
cur = conn.cursor() # to point the  first index

In [19]:
cur.execute('show databases ')# cousor moving line by line # now cursor in last line

In [20]:
res = cur.fetchall()

In [21]:
res

[('annamalai',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('student',),
 ('sys',)]

In [22]:
res[3][0]

'performance_schema'

In [23]:
for i in res:
    print(i[0])

annamalai
information_schema
mysql
performance_schema
student
sys

In [24]:
import mysql.connector as connection

try:
    mydb = connection.connect(host = "localhost", user = "root", passwd = '1998', use_pure = True)
    
    query = 'show databases'
    
    cursor = mydb.cursor()
    
    cursor.execute(query)
    
    print(cursor.fetchall())

except exception as e:
    mydb.close()
    print(str(e))

[('annamalai',), ('information_schema',), ('mysql',), ('performance_schema',), ('student',), ('sys',)]

In [25]:
import mysql.connector as connection

try:
    mydb = connection.connect(host = "localhost", user = "root", passwd = '1998', use_pure = True)
    
    query = 'create database student'
    
    cursor = mydb.cursor()
    
    cursor.execute(query)
    
    print('database created')
    mydb.close()

except Exception as e:
    mydb.close()
    print(str(e))

1007 (HY000): Can't create database 'student'; database exists

In [68]:
mydb = connection.connect(host = "localhost", database = 'annamalai', user = "root", passwd = '1998', use_pure = True)

In [69]:
mydb.is_connected()

True

In [70]:
cur = mydb.cursor()

In [71]:
cur.execute('create table test(x1 int(10), x2 varchar(20), x3 DATE)')

In [74]:
import mysql.connector as connection

try:
    mydb = connection.connect(host = "localhost",database = 'student', user = "root", passwd = '1998', use_pure = True)
    print(mydb.is_connected())
    
    query = 'create table studentdetail(student_id int(10) auto_increment primary key,first_name varchar(20),'\
    'last_name varchar(30), registrationdate DATE, class varchar(20), section varchar(10))'
    
    cursor = mydb.cursor()
    
    cursor.execute(query)
    
    print('database created')
    mydb.close()

except exception as e:
    mydb.close()
    print(str(e))

True
database created

In [28]:
import mysql.connector as connection

try:
    mydb = connection.connect(host = "localhost",database = 'student', user = "root", passwd = '1998', use_pure = True)
    print(mydb.is_connected())
    
    query = "insert into studentdetail values('4020','annamalai','subramani', '1998-12-08', 'mechanical', 'A')"
    
    cursor = mydb.cursor()
    
    cursor.execute(query)
    
    print('values are created')
    mydb.commit()
    mydb.close()

except Exception as e:
    
    print(str(e))
    mydb.close()

True
1062 (23000): Duplicate entry '4020' for key 'studentdetail.PRIMARY'

In [44]:
mydb = connection.connect(host = "localhost", database = 'annamalai', user = "root", passwd = '1998', use_pure = True)

In [45]:
cur = mydb.cursor()

In [46]:
cur.execute("insert into test values(4020, 'annamalai', '1998-12-08')")
cur.execute("insert into test values(4021, 'anand', '1999-11-08')")
cur.execute("insert into test values(4022, 'arun', '1999-02-04')")
cur.execute("insert into test values(4023, 'arul', '1998-10-05')")

In [47]:
mydb.commit() # commit can used for data insertion

In [54]:
cur = mydb.cursor()

In [55]:
cur.execute('select * from test')

In [56]:
type(cur)

mysql.connector.cursor.MySQLCursor

In [57]:
for i in cur.fetchall():
    print(i)

(4020, 'annamalai', datetime.date(1998, 12, 8))
(4020, 'annamalai', datetime.date(1998, 12, 8))
(4021, 'anand', datetime.date(1999, 11, 8))
(4022, 'arun', datetime.date(1999, 2, 4))
(4023, 'arul', datetime.date(1998, 10, 5))
(4020, 'annamalai', datetime.date(1998, 12, 8))
(4021, 'anand', datetime.date(1999, 11, 8))
(4022, 'arun', datetime.date(1999, 2, 4))
(4023, 'arul', datetime.date(1998, 10, 5))

In [58]:
cur = mydb.cursor()

In [59]:
cur.execute('select x1, x2 from test')

In [60]:
for i in cur.fetchall():
    print(i)

(4020, 'annamalai')
(4020, 'annamalai')
(4021, 'anand')
(4022, 'arun')
(4023, 'arul')
(4020, 'annamalai')
(4021, 'anand')
(4022, 'arun')
(4023, 'arul')

In [66]:
import mysql.connector as connection

try:
    mydb = connection.connect(host = "localhost",database = 'student', user = "root", passwd = '1998', use_pure = True)
    print(mydb.is_connected())
    
    query = "select * from studentdetail;"
    
    cursor = mydb.cursor()
    
    cursor.execute(query)
    for i in cursor.fetchall():
        print(i)
    mydb.close()

except Exception as e:
    print(str(e))

True
(4020, 'annamalai', 'subramani', datetime.date(1998, 12, 8), 'mechanical', 'A')

In [75]:
import mysql.connector as connection
import pandas as pd

try:
    mydb = connection.connect(host = "localhost",database = 'student', user = "root", passwd = '1998', use_pure = True)
    print(mydb.is_connected())
    
    query = "select * from studentdetail;"
    pd_data = pd.read_sql(query,mydb)
    print(pd_data)
    
    mydb.close()

except Exception as e:
    print(str(e))

True
   student_id first_name  last_name registrationdate       class section
0        4020  annamalai  subramani       1998-12-08  mechanical       A

C:\Users\annam\AppData\Local\Temp\ipykernel_1576\1061607299.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd_data = pd.read_sql(query,mydb)

In [79]:
import pandas as pd

In [80]:
mydb = connection.connect(host = "localhost", database = 'annamalai', user = "root", passwd = '1998', use_pure = True)

In [81]:
a = pd.read_sql('select * from test',mydb)

C:\Users\annam\AppData\Local\Temp\ipykernel_1576\3360146131.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  a = pd.read_sql('select * from test',mydb)

In [83]:
a.to_csv('mydata.csv')

In [84]:
a

     x1         x2          x3
0  4020  annamalai  1998-12-08
1  4020  annamalai  1998-12-08
2  4021      anand  1999-11-08
3  4022       arun  1999-02-04
4  4023       arul  1998-10-05
5  4020  annamalai  1998-12-08
6  4021      anand  1999-11-08
7  4022       arun  1999-02-04
8  4023       arul  1998-10-05

In [85]:
mydb = connection.connect(host = "localhost", database = 'annamalai', user = "root", passwd = '1998', use_pure = True)
mydb

In [86]:
cur = mydb.cursor()
cur.execute('create table mydata(n1 int(20), n2 varchar(20), n3 DATE)')

In [87]:
data = pd.read_csv('mydata.csv')

In [88]:
data

   Unnamed: 0    x1         x2          x3
0           0  4020  annamalai  1998-12-08
1           1  4020  annamalai  1998-12-08
2           2  4021      anand  1999-11-08
3           3  4022       arun  1999-02-04
4           4  4023       arul  1998-10-05
5           5  4020  annamalai  1998-12-08
6           6  4021      anand  1999-11-08
7           7  4022       arun  1999-02-04
8           8  4023       arul  1998-10-05

In [90]:
data.to_sql('mydata',mydb)

C:\Users\annam\AppData\Local\Temp\ipykernel_1576\3739664175.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data.to_sql('mydata',mydb)

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': Not all parameters were used in the SQL statement

In [ ]:
import mysql.connector as connection

try:
    mydb = connection.connect(host = "localhost",database = 'annamalai', user = "root", passwd = '1998', use_pure = True)
    print(mydb.is_connected())
    
    query = "select * from test;"
    
    cursor = mydb.cursor()
    
    cursor.execute(query)
    for i in cursor.fetchall():
        print(i)
    mydb.close()

except Exception as e:
    print(str(e))